---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions.Tier
source: html/5452df51-4e96-5805-1aa0-0c4bd1ad2087.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions.Tier Property

Level of computation for energy analysis model.

## Syntax (C#)
```csharp
public EnergyAnalysisDetailModelTier Tier { get; set; }
```

## Remarks
The default value is EnergyAnalysisModelTier::Final.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration